In [1]:
import numpy as np
import pandas as pd

s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  3.709962 -0.278010  0.799569  0.526018
2013-01-02 -0.727243  1.389378 -0.685339  1.824028
2013-01-03 -0.020533 -1.519106  1.164185  0.485685
2013-01-04 -1.535212  0.556125 -0.495036  1.060902
2013-01-05 -0.196109 -0.431129 -0.164332 -0.310474
2013-01-06 -0.552504  2.278315 -1.049327  0.522217

In [6]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [7]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [8]:
df2.head()

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [9]:
df.head()

                   A         B         C         D
2013-01-01  3.709962 -0.278010  0.799569  0.526018
2013-01-02 -0.727243  1.389378 -0.685339  1.824028
2013-01-03 -0.020533 -1.519106  1.164185  0.485685
2013-01-04 -1.535212  0.556125 -0.495036  1.060902
2013-01-05 -0.196109 -0.431129 -0.164332 -0.310474

In [10]:
df.tail(3)

                   A         B         C         D
2013-01-04 -1.535212  0.556125 -0.495036  1.060902
2013-01-05 -0.196109 -0.431129 -0.164332 -0.310474
2013-01-06 -0.552504  2.278315 -1.049327  0.522217

In [12]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [14]:
df.to_numpy()

array([[ 3.70996224, -0.27800977,  0.79956947,  0.52601824],
       [-0.72724289,  1.38937831, -0.68533866,  1.82402815],
       [-0.02053334, -1.51910569,  1.16418521,  0.48568484],
       [-1.53521237,  0.55612513, -0.49503592,  1.06090219],
       [-0.19610882, -0.43112938, -0.16433153, -0.31047396],
       [-0.55250419,  2.2783147 , -1.04932714,  0.5222169 ]])

In [15]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [16]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.113060  0.332596 -0.071713  0.684729
std    1.839403  1.366564  0.872539  0.710092
min   -1.535212 -1.519106 -1.049327 -0.310474
25%   -0.683558 -0.392849 -0.637763  0.494818
50%   -0.374307  0.139058 -0.329684  0.524118
75%   -0.064427  1.181065  0.558594  0.927181
max    3.709962  2.278315  1.164185  1.824028

In [17]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    3.709962   -0.727243   -0.020533   -1.535212   -0.196109   -0.552504
B   -0.278010    1.389378   -1.519106    0.556125   -0.431129    2.278315
C    0.799569   -0.685339    1.164185   -0.495036   -0.164332   -1.049327
D    0.526018    1.824028    0.485685    1.060902   -0.310474    0.522217

In [18]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.526018  0.799569 -0.278010  3.709962
2013-01-02  1.824028 -0.685339  1.389378 -0.727243
2013-01-03  0.485685  1.164185 -1.519106 -0.020533
2013-01-04  1.060902 -0.495036  0.556125 -1.535212
2013-01-05 -0.310474 -0.164332 -0.431129 -0.196109
2013-01-06  0.522217 -1.049327  2.278315 -0.552504

In [19]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-03 -0.020533 -1.519106  1.164185  0.485685
2013-01-05 -0.196109 -0.431129 -0.164332 -0.310474
2013-01-01  3.709962 -0.278010  0.799569  0.526018
2013-01-04 -1.535212  0.556125 -0.495036  1.060902
2013-01-02 -0.727243  1.389378 -0.685339  1.824028
2013-01-06 -0.552504  2.278315 -1.049327  0.522217

In [21]:
%time sum(x for x in range(100000))

CPU times: user 10.4 ms, sys: 0 ns, total: 10.4 ms
Wall time: 10.1 ms

4999950000